package kazantseva.task;

import edu.stanford.nlp.ling.CoreAnnotations;
import edu.stanford.nlp.pipeline.Annotation;
import edu.stanford.nlp.pipeline.StanfordCoreNLP;
import edu.stanford.nlp.util.CoreMap;

import java.util.*;

public class Test {
    public static void main(String[] args) {
        String text = "\"القطــن\nالاهميه الاقتصادية :\nتحتل" +
                " زراعة القطن مساحات شاسعة في سهل تهامة وخاصة في وادي رمـاع\nووادي زبيد ، ويزرع في الغالب" +
                " القطن متوسط التيلة لتلبية إحتياجـات الصناعـات\nالنسيجية المحلية. حيث كانت زراعة القطن حتى" +
                " وقت قريب ترتبط بتعاقدات سـنوية\nبين مؤسسة القطن والمزارعين، يحصل المزارعون بموجبها على قروض " +
                "تساعدهم\nعلى زراعة المحصول، وتتولى المؤسسة توفير البذور المعاملة بالمبيدات الحشـرية،\nكما" +
                " تنظم وقاية المحصول من خلال الحملات التي تقوم بها الإدارة العامـة للوقايـة\nخلال فترة محددة" +
                " من كل عام .\nوقد شهدت زراعة القطن تدهورا مستمرا خلال الاعـوام الماضيـة، نظـرا\nللتكاليف " +
                "العالية لإنتاجه مقارنة بأسعاره الزهيدة التي تحددها المؤسسة، وقـد أتخـذ\nمؤخرا قرارا وزاريا" +
                " قضى بتحرير القطن من الأسعار الثابتة ، فأعطى للمزارعيـن\nحرية بيع محصولهم بأسعار العرض والطلب في" +
                " كل موســـــــم، ويتوقـع أن يكـون\nمردود هذا القرار إيجابيا على المزارعين، خصوصا إذا ما ترافـق مـع" +
                " إجـراءات\nتنظيمية لمسألة إكثار البذور المعتمدة، وتنظيم الحلج الذي تقوم به المؤسسة حاليا.\nمواسم" +
                " الزراعة :\nيزرع القطن في سهل تهامة خلال موسم الخريف ، وتتركز زراعته خــلال\nأشهر يوليو أغسطس، ويمكن أن" +
                " تمتد زراعة إلى نهاية شــهر سـبتمبر، وزراعـة\nالقطن المتأخرة تتعرض للإصابات الحشرية والمرضية ويقل فيها" +
                " الإنتاج.\nالأصناف والانتاجية :\nيعتبر الصنف أكالا SG٢ هو الصنف الوحيد المنتشر في سهل تهامة، وهـو\nمن" +
                " الأصناف متوسطة التيلة، ويستمر نموه في الحقل بين خمسة إلى ســتة أشـهر،\nوتتراوح إنتاجية الصنف " +
                "المعمم بين ۱ طن – ۲ طن للهكتار ، وتبلغ الإنتاجية فـ\nظروف المحطات البحثية ۲.5-۳,۰ طن/ هكتار.\",\n" +
                "    \"الحصاد والإنتاجية" +
                " :\nيستمر نمو محصول الدجرة 5-6 أشهر ، ويجني المحصول على دفعات قـد\nتصل إلى 3-4 جنيات. حيث تجمع القرون " +
                "الناضجة وتجفف في الشمس لمدة يومين\nإلى ثلاثة أيام، ثم تلبج القرون يدويا ويستخرج الحب، ويترك ليجفف فـترة" +
                " إضافيـة\nلمدة ثلاثة إلى خمسة أيام، ثم يعبئ في جواني أو أكياس للخزن والتسويق.\nيترواح إنتاج الهكتار من " +
                "الدجرة في الزراعـة البينيـة أو التحميليـة بيـن\n500كجم إلى 750 كجم.\nوفي الزراعة المتخصصة تحت نظامي" +
                " الري من الآبار أو السيول تـــــــتراوح\nالإنتاجية بين 750 كجم إلى 1,5 طن/هكتار.\nالعقب في الدجرة" +
                " :\nيلجأ بعض المزارعين إلى إدخال مياه السيول بعد إستكمال جني المحصـول\nالأول، حيث يعطى المحصول " +
                "نموا جديدا (عقب) يحصل منه إنتاجا سواء على شكل\nحب أو يحصد أعلاف بحسب الموسم وإحتياجات السوق.\",\n" +
                "    \"التربة المناسبة" +
                " :\nتجود زراعة القطن في مختلف الترب الرسوبية الثقيلة والمتوس طة القـوام\nجيدة الصرف.\nمعدلات " +
                "البذور:\nيحتاج الهكتار من 40-50 كيلو بذور معاملة ضد الأرضة ، وفي حالة عـ\nعـدم\nمعاملة" +
                " البذور ينصح بزيادة معدلاتها لتعويض النقص الناتج عن الإصابـة المبكـرة\nللمحصول بالارضة.\nتحضير " +
                "الأرض:\nتحرث الأرض مرتين، المرة الأولى بعد حصاد المحصول السابق للتخلـ\nص\nمن الحشائش وللحفاظ على " +
                "الرطوبة، والمرة الثانية عند بداية الموسم، وبعد الحراثـة\nتسوى الأرض بالمحر وتقام فيها قنوات" +
                " الري، وتخطط على أبعاد 60سم-0 اســــــم\nوفي حالة الري من الوادي تقسم الأرض إلى شرائح طويلة" +
                " ، ومن ثم تسـقـى مـن\nالوادي.\nالزراعة والمسافات :\nيزرع القطن في خطوط إذا كان الري من الآبار" +
                " ، ويراعى أن تكون المسـلفة\nبين الخطوط 60-٧٠سم ، وبين الجور في الخط ٢٥-٣٠سم ، وفي حالة الري" +
                " مـن\nالوادي يزرع القطن في سطور أو جور وذلك بوضع 4-5 بذور فـي ل جـورة\nوبمسافة ٢٥-٣٠ بين " +
                "الجورة والأخرى .\nسم\nالترقيع والخف :\nتتم عملية الترقيع بعد 10-15 يوم من الزراعة،" +
                " ولا تتم عملية الخف بسبب\nإحتمالات الإصابة بالأرضة في فترات مختلفة من عمر النبات.\",\n" +
                "    \"التعشيب :\nتتم مكافحة الحشائش يدويا بالعزيق ، وتتراوح مرات العزيق بحسب كثافـة\nالحشائش، وبالذات في" +
                " حالة زراعة القطن على نظام الريات المتعددة (الـري مـن\nالآبار)، وتجرى العزقة الأول" +
                " بعد 40 يوم من الزراعة ، وتتراوح مرات العزيق مـل\nبين ثلاث إلى أربع مرات.\nالـري" +
                " :\nتتراوح عدد مرات الري لمحصول القطن بين خمس ريـات وثمـان ريـات\nطوال فترة نمو" +
                " المحصول، وفي ظروف الري من الوادي يعطي المزارعـون ريـة\nإلى ريتين غزيرتين قبل الزراعة" +
                " ، ثم تعطى رية أخرى من الوادي أو من البئر عند\nمرحلة التزهير.\nالتسميد :\nينصح" +
                " بإضافة الأسمدة البلدية دوريا إلى حقول القطن، وخصوصا تلك التـ\nلا تصلها مياه السيول،" +
                " كما يوصى بإضافة الأسمدة الكيماوية بواقع ٢٥٠ كجم يوريـا\nللهكتار على دفعتين، الأولى عند" +
                " تجهيز الأرض والثانية عند مر،\nرحلة التزهير، كمـا\nيوصى باستخدام سماد السوبر فوسفات الثلاثي" +
                " بواقع١٢٠ كجم للهكتار تضاف دفعـة\nواحدة عند تجهيز الأرض قبل الزراعة مباشرة.\nوبالنسبة للقطن " +
                "الذي يروى من الوادي يوصى بإضافـة ١٢٠ كـجـم يـوريـا\nللهكتار، وتضاف قبل جفاف سطح التربة بعد رية" +
                " السيول.\nالوقاية :\nيتعرض محصول القطن إلى العديد من الإصابات الحشرية والمرضية يمكـن\nتحديد" +
                " أهمها على النحو التالي : -\nالحشرة الآفة مرحلة الإصابة | أعراض الإصابة\nالأرضة\nتلف" +
                " کامل\nالنبات\nالذبابة البيضاء\nمختلف\nالمراحل\nمختلف\nالمراحل\nالوقاية\n-معاملة" +
                " البـذور بميـد مناس\nتوصيات البحوث\nظهور فراشات | الرش بأحد المبيدات التالية :\nسومسدين" +
                " ۲۰% بمعدل 1سم/ لتر ماء\n- دايمثويت 40% بمعدل 1.5سم3/ لترماء\nبريمون 50% بمعدل1,0سم/ لتر ماء\",\n" +
                "    \"الحشرة /\nالآفة\nالمن\nالجاسيد\nديدان اللون\nالذبول\nمرحلة\nالإصابة\nمختلف\nالمراحل" +
                "\nمختلف\nالمراحل\nمراحل تكون\nاللوز\nبعد الإنبات\nأعراض\nالإصابة\nظهور سائل\nلزج يغير " +
                "لون\nالأوراق إلى\nاللون الاسود\nتلف القمة\nالوقاية\\n||\n11\n||\n||\nالنامية\nوجود" +
                " ثقوب في | -حرق بقايا النباتات السابقة\nحراثة الأرض بعـد حصـاد المحصـول\nاللون " +
                "باللوز\n-حر\nبداخلها يرقات. | السابق\nالرش بأحد المبيات التالية:\n- کابرايل 85% بمعدل ۲جرام/ لت";
        String[] keywords = {"محصول", "الإنتاجية", "التربة", "التعشيب", "أعراض", "الإصابة", "الـري", "الوقاية"};

        // Set up Stanford CoreNLP pipeline
        Properties props = new Properties();
        props.setProperty("annotators", "tokenize, ssplit");
        StanfordCoreNLP pipeline = new StanfordCoreNLP(props);

        Map<String, List<String>> result = new HashMap<>();

        // Process each keyword and find relevant sentences
        for (String keyword : keywords) {

            List<String> relevantSentences = new ArrayList<>();
            // Tokenize the text
            Annotation annotation = new Annotation(text);
            pipeline.annotate(annotation);

            // Iterate over the sentences
            List<CoreMap> sentences = annotation.get(CoreAnnotations.SentencesAnnotation.class);
            for (CoreMap sentence : sentences) {
                String sentenceText = sentence.get(CoreAnnotations.TextAnnotation.class);
                if (sentenceText.toLowerCase().contains(keyword.toLowerCase())) {
                    relevantSentences.add(sentenceText);
                }
            }
            result.put(keyword, relevantSentences);
        }

        System.out.println("Relevant Sentences:");
        for (String k : keywords) {

            System.out.println(k + " : ----------------------------------------\n");
            if (result.get(k) != null) {
                for (String v : result.get(k)) {
                    System.out.println(v);
                }
            }
        }
    }
}
